In [2]:
import pandas as pd

In [3]:
import numpy as np

In [5]:
labels = ['a','b','c']
arr = [0,10,20]
my_arr = np.array(arr)
d = {'a' : 0, 'b' : 10, 'c' : 20}

In [6]:
pd.Series(data=arr, index=labels)

a     0
b    10
c    20
dtype: int64

In [7]:
pd.Series(data=arr)

0     0
1    10
2    20
dtype: int64

In [8]:
pd.Series(arr,labels)

a     0
b    10
c    20
dtype: int64

In [9]:
d

{'a': 0, 'b': 10, 'c': 20}

In [10]:
pd.Series(d)

a     0
b    10
c    20
dtype: int64

In [11]:
pd.Series([sum,len,print])

0      <built-in function sum>
1      <built-in function len>
2    <built-in function print>
dtype: object

In [12]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','Italy','Japan'])

In [13]:
ser1

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [14]:
ser2 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [15]:
ser2

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [16]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [17]:
#
#Data Frames
#

from numpy.random randn

In [18]:
from numpy.random import randn

In [19]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [20]:
df

          W         X         Y         Z
A -0.321686 -0.742733  0.168578 -0.176268
B -0.203771  0.234245  0.650230 -0.201073
C -1.867470  1.035438  0.881004  1.720705
D -2.013181 -0.094690 -0.374943 -1.577721
E  0.163262 -0.374123  1.723144 -0.814214

In [21]:
np.random.seed(101)

In [22]:
df

          W         X         Y         Z
A -0.321686 -0.742733  0.168578 -0.176268
B -0.203771  0.234245  0.650230 -0.201073
C -1.867470  1.035438  0.881004  1.720705
D -2.013181 -0.094690 -0.374943 -1.577721
E  0.163262 -0.374123  1.723144 -0.814214

In [23]:
df['W']

A   -0.321686
B   -0.203771
C   -1.867470
D   -2.013181
E    0.163262
Name: W, dtype: float64

In [24]:
type(df['W'])

pandas.core.series.Series

In [25]:
type(df)

pandas.core.frame.DataFrame

In [26]:
df[['W','Z']]

          W         Z
A -0.321686 -0.176268
B -0.203771 -0.201073
C -1.867470  1.720705
D -2.013181 -1.577721
E  0.163262 -0.814214

In [29]:
df['new'] = df['W'] + df['Y']

In [30]:
df

          W         X         Y         Z       new
A -0.321686 -0.742733  0.168578 -0.176268 -0.153108
B -0.203771  0.234245  0.650230 -0.201073  0.446460
C -1.867470  1.035438  0.881004  1.720705 -0.986465
D -2.013181 -0.094690 -0.374943 -1.577721 -2.388125
E  0.163262 -0.374123  1.723144 -0.814214  1.886406

In [33]:
df.drop('new',axis=1)

          W         X         Y         Z
A -0.321686 -0.742733  0.168578 -0.176268
B -0.203771  0.234245  0.650230 -0.201073
C -1.867470  1.035438  0.881004  1.720705
D -2.013181 -0.094690 -0.374943 -1.577721
E  0.163262 -0.374123  1.723144 -0.814214

In [34]:
df

          W         X         Y         Z       new
A -0.321686 -0.742733  0.168578 -0.176268 -0.153108
B -0.203771  0.234245  0.650230 -0.201073  0.446460
C -1.867470  1.035438  0.881004  1.720705 -0.986465
D -2.013181 -0.094690 -0.374943 -1.577721 -2.388125
E  0.163262 -0.374123  1.723144 -0.814214  1.886406

In [35]:
#Eğer inPlace kullanmaz isek drop ettiğimiz column silinmez

In [36]:
df.drop('new',axis=1,inplace=True)

In [37]:
df

          W         X         Y         Z
A -0.321686 -0.742733  0.168578 -0.176268
B -0.203771  0.234245  0.650230 -0.201073
C -1.867470  1.035438  0.881004  1.720705
D -2.013181 -0.094690 -0.374943 -1.577721
E  0.163262 -0.374123  1.723144 -0.814214

In [38]:
df.shape

(5, 4)

In [39]:
df.drop('E',axis=0,inplace=True)

In [40]:
df

          W         X         Y         Z
A -0.321686 -0.742733  0.168578 -0.176268
B -0.203771  0.234245  0.650230 -0.201073
C -1.867470  1.035438  0.881004  1.720705
D -2.013181 -0.094690 -0.374943 -1.577721

In [41]:
#satırlarda axis=0 sütunlarda axis=1 
#ayrıca axis=0 default olarak gelir satırlarda kullanmaya gerek yoktur

In [42]:
#Row

In [50]:
df.loc['C']

W   -1.867470
X    1.035438
Y    0.881004
Z    1.720705
Name: C, dtype: float64

In [52]:
df.iloc[2]

W   -1.867470
X    1.035438
Y    0.881004
Z    1.720705
Name: C, dtype: float64

In [56]:
df.loc['A','Y']

0.16857803239937738

In [57]:
df

          W         X         Y         Z
A -0.321686 -0.742733  0.168578 -0.176268
B -0.203771  0.234245  0.650230 -0.201073
C -1.867470  1.035438  0.881004  1.720705
D -2.013181 -0.094690 -0.374943 -1.577721

In [58]:
df.loc[['B','D'],['X','Z']]

          X         Z
B  0.234245 -0.201073
D -0.094690 -1.577721

In [59]:
# Conditional DataFrame

In [60]:
df

          W         X         Y         Z
A -0.321686 -0.742733  0.168578 -0.176268
B -0.203771  0.234245  0.650230 -0.201073
C -1.867470  1.035438  0.881004  1.720705
D -2.013181 -0.094690 -0.374943 -1.577721

In [64]:
df.loc['E'] = df.loc['D'] + df.loc['C']

In [65]:
df

          W         X         Y         Z
A -0.321686 -0.742733  0.168578 -0.176268
B -0.203771  0.234245  0.650230 -0.201073
C -1.867470  1.035438  0.881004  1.720705
D -2.013181 -0.094690 -0.374943 -1.577721
E -3.880651  0.940748  0.506061  0.142984

In [66]:
df > 0

       W      X      Y      Z
A  False  False   True  False
B  False   True   True  False
C  False   True   True   True
D  False  False  False  False
E  False   True   True   True

In [67]:
df[df>0]

    W         X         Y         Z
A NaN       NaN  0.168578       NaN
B NaN  0.234245  0.650230       NaN
C NaN  1.035438  0.881004  1.720705
D NaN       NaN       NaN       NaN
E NaN  0.940748  0.506061  0.142984

In [68]:
df['W'] > 0

A    False
B    False
C    False
D    False
E    False
Name: W, dtype: bool

In [72]:
df[df['X']>0]

          W         X         Y         Z
B -0.203771  0.234245  0.650230 -0.201073
C -1.867470  1.035438  0.881004  1.720705
E -3.880651  0.940748  0.506061  0.142984

In [74]:
df[df['X']>0]['X']

B    0.234245
C    1.035438
E    0.940748
Name: X, dtype: float64

In [76]:
boolen = df['X']>0
result = df[boolen]

In [77]:
result

          W         X         Y         Z
B -0.203771  0.234245  0.650230 -0.201073
C -1.867470  1.035438  0.881004  1.720705
E -3.880651  0.940748  0.506061  0.142984

In [85]:
result[['W','Y']]

          W         Y
B -0.203771  0.650230
C -1.867470  0.881004
E -3.880651  0.506061

In [82]:
my_cols = ['W','Y']
result[my_cols]

          W         Y
B -0.203771  0.650230
C -1.867470  0.881004
E -3.880651  0.506061

In [93]:
df[(df['W']<0) & (df['Z']<0)]

          W         X         Y         Z
A -0.321686 -0.742733  0.168578 -0.176268
B -0.203771  0.234245  0.650230 -0.201073
D -2.013181 -0.094690 -0.374943 -1.577721

In [94]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.321686 -0.742733  0.168578 -0.176268
1     B -0.203771  0.234245  0.650230 -0.201073
2     C -1.867470  1.035438  0.881004  1.720705
3     D -2.013181 -0.094690 -0.374943 -1.577721
4     E -3.880651  0.940748  0.506061  0.142984

In [95]:
newind = 'CA NY WY OR CO'.split()

In [96]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [97]:
df['cities'] = newind

In [98]:
df

          W         X         Y         Z cities
A -0.321686 -0.742733  0.168578 -0.176268     CA
B -0.203771  0.234245  0.650230 -0.201073     NY
C -1.867470  1.035438  0.881004  1.720705     WY
D -2.013181 -0.094690 -0.374943 -1.577721     OR
E -3.880651  0.940748  0.506061  0.142984     CO

In [111]:
df

               W         X         Y         Z
cities
CA     -0.321686 -0.742733  0.168578 -0.176268
NY     -0.203771  0.234245  0.650230 -0.201073
WY     -1.867470  1.035438  0.881004  1.720705
OR     -2.013181 -0.094690 -0.374943 -1.577721
CO     -3.880651  0.940748  0.506061  0.142984

In [112]:
df.T

cities        CA        NY        WY        OR        CO
W      -0.321686 -0.203771 -1.867470 -2.013181 -3.880651
X      -0.742733  0.234245  1.035438 -0.094690  0.940748
Y       0.168578  0.650230  0.881004 -0.374943  0.506061
Z      -0.176268 -0.201073  1.720705 -1.577721  0.142984

In [113]:
#Part3 DF

In [118]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [119]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [125]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [130]:
df.loc['G1'].loc[1]

A   -0.134841
B    0.390528
Name: 1, dtype: float64

In [132]:
df.index.names

FrozenList([None, None])

In [133]:
df.index.names = ['Group','Num']

In [134]:
df

                  A         B
Group Num
G1    1   -0.134841  0.390528
      2    0.166905  0.184502
      3    0.807706  0.072960
G2    1    0.638787  0.329646
      2   -0.497104 -0.754070
      3   -0.943406  0.484752

In [135]:
df.loc['G2'].loc[1]['A']

0.638787013499328

In [136]:
df.xs('G1')

            A         B
Num
1   -0.134841  0.390528
2    0.166905  0.184502
3    0.807706  0.072960

In [137]:
df.xs(1,level='Num')

              A         B
Group
G1    -0.134841  0.390528
G2     0.638787  0.329646

In [138]:
df.xs('A',axis=1)

Group  Num
G1     1     -0.134841
       2      0.166905
       3      0.807706
G2     1      0.638787
       2     -0.497104
       3     -0.943406
Name: A, dtype: float64

In [139]:
df['A']

Group  Num
G1     1     -0.134841
       2      0.166905
       3      0.807706
G2     1      0.638787
       2     -0.497104
       3     -0.943406
Name: A, dtype: float64

In [140]:
df.xs('A',axis=1).loc['G1']

Num
1   -0.134841
2    0.166905
3    0.807706
Name: A, dtype: float64